# Equals Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
GuidEnum..::..Equals Method
GuidEnum Class See Also
---
Compares two Guid-based enum object based on their concrete class and GUID value.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public override bool Equals(
	Object obj
)
```

Visual Basic
---
```text
Public Overrides Function Equals ( _
	obj As Object _
) As Boolean
```

Visual C++
---
```text
public:
virtual bool Equals(
	Object^ obj
) override
```

# ### Parameters
obj
    Type: System..::..Object
# See Also
GuidEnum Class
Autodesk.Revit.DB Namespace